[{"title":"Dealing with opaque responses in Service Worker","slug":"opaque-responses-service-worker","image":"/articleimgs/phone-taking-photo-selfie.pexels.jpg","tags":["Service Worker","Offline Capabilities"],"description":"One of the most complex and possibly annoying aspect of the offline mode implementation for Progressive Web Apps is when it needs to deal with cross-origin requests. As Service Worker is intercepting all the HTTP requests originating from our application, it means that also these reaching the external servers are to be handled, and this in turn means we need to deal with Cross-Origin Resource Sharing (CORS).","weight":1,"source":"wwcd"},{"title":"Progressive Web Apps – standard or buzzword?","slug":"progressive-web-apps-standard-or-buzzword","image":"/articleimgs/adult-books-business-coffee.pexels.jpg","tags":["PWA","Service Worker"],"description":"Progressive Web Apps (PWA) is modern way to build applications, including mobile ones, using purely web technologies and relying purely on the capabilities and strengths the Web platform. Historically, it was the lack of these capabilities on the Web that caused the boom of the mobile apps, using so-called \"native\" (platform-specific) development approaches.","weight":2,"source":"wwcd"},{"title":"Tracking home screen visits and installations","slug":"tracking-home-screen-visits-installations","image":"/articleimgs/black-tablet-computer.pexels.jpg","tags":["PWA","Home Screen Installability"],"description":"Analytics is the key non-functional feature our applications need to have nowadays. It's the hard numbers that should have the decisive voice whenever it must be chosen whether a feature, design or idea is worth exploring. With new Web APIs and the rise of the Progressive Web Applications, there are new aspects we should keep track of and possibly use as an axis of our analysis.","weight":1,"source":"wwcd"},{"title":"How to use Chrome Dev Tools Service Worker switches","slug":"use-chrome-dev-tools-switches","image":"/articleimgs/analogue-console-control.pexels.jpg","tags":["PWA","Service Worker"],"description":"Google Chrome, as expected from the Service Worker API and whole Progressive Web Apps ideas main proponent, offers probably the richest developer tooling to ease the debugging, testing and experimenting with the APIs. Chrome's Dev Tools has a whole Application tab dedicated to PWA-related matters.","weight":2,"source":"wwcd"},{"title":"How to use Geolocation API with Promises","slug":"use-geolocation-api-promises","image":"/articleimgs/beige-map.pexels.jpg","tags":["Geolocation"],"description":"Geolocation API is definitely one of the best known device integration APIs we have on the web, both thanks its usefulness as well as its age. It lets the apps gain access to the user's location, expressed as geo-coordinates and subscribe to its changes. The possible usages range from location-based content filtering through mapping services to city games.","weight":1,"source":"wwcd"},{"title":"A Good Push Notification","url":"https://pwafire.org/developer/docs/a-good-push-notification/","image":"/articleimgs/letter-envelopes.pexels.jpg","tags":["Push Notifications"],"description":"What makes a good Push Notifcation? Get tips to help you push value to your users and not users away.","source":"pwafire.org"},{"title":"Add Native App Install Banner","url":"https://pwafire.org/developer/docs/native-app-pwa/","image":"/articleimgs/street-lights.pexels.jpg","tags":["Home Screen Installability"],"description":"Add support to tell the Web Browser to prompt the user with your native app install banner instead of the web app.","weight":1,"source":"pwafire.org"},{"title":"Start Secure With HTTPS","url":"https://pwafire.org/developer/docs/start-secure-with-https/","image":"/articleimgs/gold-padlock-locking-door.pexels.jpg","tags":["HTTPS","PWA"],"description":"HTTPS is a crucial part of the user experience. It’s not just for really important or security-sensitive sites.","weight":1,"source":"pwafire.org"}]