{"title":"Handling Service Worker updates – how to keep the app updated and stay sane","slug":"handling-service-worker-updates","html":"<p>Most of the Service Worker tutorials we can find on the Web focus on the initial development efforts needed to get the <a href=\"/offline.html\">offline mode capabilities</a> or performance gains for subsequent visits. And although it&#39;s definitely valuable for having a grasp on the advantages of employing this basic Progressive Web App building block, it&#39;s also extremely important to be aware that it&#39;s not enough. For production readiness, we need to make sure our Service Worker will be maintainable in the future. We need to have the update strategy in place not to cut off our users from actually getting the updates of our PWA.</p>\n<h2 id=\"the-update-problem\">The update problem</h2>\n<p>Service Worker is a piece of JavaScript that works as a single controller &amp; network proxy for all the instances of our application. That means that all the browser windows share the same active Service Worker. It has a significant consequence for the lifetime of Service Worker&#39;s code. It cannot be seamlessly updated as long as there is any window that it serves. In other words, if our users tend to forget about already opened tabs (who doesn&#39;t?) or it&#39;s in our app&#39;s nature to be opened forever (like it is for email clients, messaging apps or apps in kiosk mode, for instance), the Service Worker will be never updated, even though the browser might already have detected the pending update. </p>\n<p>Moreover, simple refreshing is not sufficient to make room for the new Service Worker to take over, even if there&#39;s only one tab of our application running. This is because browsers do not unload the earlier instance of the website immediately when we request the refresh – for some time the new instance being loaded exists simultaneously in the memory next to the previous one, being unloaded. So the number of windows served by the Service Worker doesn&#39;t fall down to zero in this case and the new Service Worker ready to be used can&#39;t take over. Hard-refresh (Control+Shift+R-kind) is sufficient, but we can&#39;t expect our users to use it for the ordinary browsing.</p>\n<p>Not applying the Service Worker update might mean that our outdated Service Worker runs for ages and serves our users with assets from the cache that we expect to already be long-forgotten. So it&#39;s a problem not to be ignored. It&#39;s the developer&#39;s worry to make sure our app will not be &quot;frozen in the past&quot;. And we need to ensure we have a solution in place before our first Service Worker lands on production.</p>\n<h2 id=\"first-attempt--forceful-takeover\">First attempt – forceful takeover</h2>\n<p>Fortunately, there is a programmatic way for the waiting Service Worker (the one that we received and installed as the newly updated controller of our app) to take over control over the existing clients. We can call <code>self.skipWaiting()</code> from within the new Service Worker – it immediately stops the previously active Service Worker and activates the new one, so that all the currently opened windows will be served by the new one.</p>\n<p>When to call it? We may call it at the end of <code>install</code> event handling – it is what most examples on the Web do. It has a significant and often overlooked pitfall, though. All the already opened windows were loaded with the help of the previous Service Worker that potentially contained different versions of the assets. Starting from the rather indeterministic point in time (possibly while the page is still being loaded), the same windows are served by the new Service Worker. Imagine what happens if our code is dynamically loaded using code-splitting or if we employ another lazy-loading techniques. Depending on the strategies we use, we might end up not being able to serve the expected asset anymore or we serve assets in incompatible version – it has a high probability of messing things up, so it&#39;s only suitable for the simplest apps, for example light on JS content websites.</p>\n<figure>\n  <img src=\"/articleimgs/sw-updates-1.png\" alt=\"Diagram of partial Service Worker update cycle – attempt 1\" />\n  <figcaption>Diagram of partial Service Worker update cycle – attempt 1</figcaption>\n</figure>\n\n<h2 id=\"even-more-forceful-takeover\">Even-more-forceful takeover</h2>\n<p>This technique is sometimes taken further by ensuring the app is never running in that half-old, half-new state. To avoid it, we may order all our opened windows (called <code>clients</code> in the Service Worker parlance) to refresh immediately after <code>skipWaiting</code> was called. There are at least two ways to do it – by iterating over <code>self.clients</code> from the newly-activated Service Worker and asking them to navigate to their current URLs:</p>\n<pre><code>// Service Worker-based solution\nself.addEventListener(&#39;activate&#39;, async () =&gt; {\n  // after we&#39;ve taken over, iterate over all the current clients (windows)\n  const tabs = await self.clients.matchAll({type: &#39;window&#39;})\n  tabs.forEach((tab) =&gt; {\n    // ...and refresh each one of them\n    tab.navigate(tab.url)\n  })\n})</code></pre><p>...or by listening to <code>controllerchange</code> events from the app and refreshing when it happens:</p>\n<pre><code>// app-based solution\nlet refreshing = false;\n\n// detect controller change and refresh the page\nnavigator.serviceWorker.addEventListener(&#39;controllerchange&#39;, () =&gt; {\n    if (!refreshing) {\n        window.location.reload()\n        refreshing = true\n    }\n})</code></pre><p>This approach solves the previous inconsistency problem, but introduces a UX challenge. Refreshing the page without any clear sign for the user might be unexpected. And what if our user was in the middle of an important operation, for example entering credit card details to pay us for our services? Seemingly random refresh might not be what we would want then.</p>\n<figure>\n  <img src=\"/articleimgs/sw-updates-2.png\" alt=\"Diagram of partial Service Worker update cycle – attempt 2\" />\n  <figcaption>Diagram of partial Service Worker update cycle – attempt 2</figcaption>\n</figure>\n\n<h2 id=\"deferred-takeover-approach\">Deferred takeover approach</h2>\n<p>We need to have a way to update the Service Worker and refresh without breaking the user flow. There are several approaches we can take. Which one is the right one depends on the characteristics of our app:</p>\n<ul>\n<li>it might be possible to detect a moment when the user is idle, not within any action or flow – but this kind of detection might be hard or impossible for some apps;</li>\n<li>we might update while transitioning between pages, if we have a Single-Page App that doesn&#39;t actually reloads between views – this is probably a moment when the active tab can be refreshed without causing harm in most apps, but what if there&#39;s an action in progress in another tab?</li>\n<li>finally, if we want to stay on the safe side, we might ask the user to apply the update by showing some kind of UI notification informing about the new version pending.</li>\n</ul>\n<p>What Web Can Do website updates the Service Worker and refreshes while transitioning between pages as it&#39;s rather simple and it would not be especially harmful in case someone&#39;s demo opened in another tab will get refreshed.</p>\n<h2 id=\"how-can-skipwaiting-be-deferred\">How can <code>skipWaiting</code> be deferred?</h2>\n<p>When we already know which of the deferring strategy we&#39;ll use, we need to have a way to actually defer the update. This means, we can no longer call <code>skipWaiting</code> within <code>install</code> handler in Service Worker – we need the app to signal the Service Worker about when it&#39;s the right time to call <code>skipWaiting</code>. This in turn means the app need to know about pending Service Worker update to take action, like to wait for the user to finish the current operation or display the &quot;new version available&quot; notification to the user, depending what&#39;s our refresh strategy.</p>\n<p>The browser checks for the new Service Worker version periodically, as well as on the <code>navigator.serviceWorker.register()</code> call on every visit that happens at least 24 hours after the last Service Worker update. When the change is detected (it&#39;s a byte-by-byte content comparison), the new Service Worker is being installed (its <code>install</code> event handler is executed) as well as it is signaled to the app by <code>updatefound</code> event we can handle:</p>\n<pre><code>// get the ServiceWorkerRegistration instance\nconst registration = await navigator.serviceWorker.getRegistration();\n// (it is also returned from navigator.serviceWorker.register() function)\n\nif (registration) { // if there is a SW active\n    registration.addEventListener(&#39;updatefound&#39;, () =&gt; {\n        console.log(&#39;Service Worker update detected!&#39;);\n    });\n}</code></pre><p>So far so good. Is this handler a good place to trigger our update UX (like that &quot;new version available&quot; notification)? No, it&#39;s not. At this point we only know the browser detected the Service Worker file change. The new Service Worker instance is not yet ready for activation, because its <code>install</code> handler is not yet complete and it actually may fail to install, for instance when any of its network calls fail. We must wait until the new instance is ready for activation (its state is <code>installed</code>):</p>\n<pre><code>// our new instance is visible under installing property, because it is in &#39;installing&#39; state\n// let&#39;s wait until it changes its state\nregistration.installing.addEventListener(&#39;statechange&#39;, () =&gt; {\n    if (registration.waiting) {\n        // our new instance is now waiting for activation (its state is &#39;installed&#39;)\n        // we now may invoke our update UX safely\n    } else {\n        // apparently installation must have failed (SW state is &#39;redundant&#39;)\n        // it makes no sense to think about this update any more\n    }\n});</code></pre><p>By ensuring our update UX is only triggered when we&#39;re sure there&#39;s a Service Worker instance visible under <code>registration.waiting</code> (successfully installed, waiting for activation), we avoid running it senselessly for failed updates or too quickly, when the installation is still in progress.</p>\n<p>Now, the third step in this update dance is to actually signal our new Service Worker instance when the user (or our heuristic) decided it&#39;s a good time to apply the update. It&#39;s the Service Worker that needs to call <code>skipWaiting</code> and we can only communicate with it by sending it a message with <code>postMessage</code> API:</p>\n<pre><code>notificationBanner.addEventListener(&#39;click&#39;, () =&gt; {\n    registration.waiting.postMessage(&#39;SKIP_WAITING&#39;);\n});</code></pre><p>To receive the message in the Service Worker, we need to register a <code>message</code> event handler:</p>\n<pre><code>self.addEventListener(&#39;message&#39;, (event) =&gt; {\n    if (event.data === &#39;SKIP_WAITING&#39;) {\n        self.skipWaiting();\n    });\n});</code></pre><p>Given we have <code>controllerchange</code> event handler ready at the app side, as we sketched it already, sending <code>SKIP_WAITING</code> message to the new Service Worker will cause it to activate and subsequently all the tabs to refresh, removing any inconsistency risk.</p>\n<figure>\n  <img src=\"/articleimgs/sw-updates-3.png\" alt=\"Diagram of full Service Worker update cycle\" />\n  <figcaption>Diagram of full Service Worker update cycle</figcaption>\n</figure>\n\n<p>Last thing to think about is what happens when the user ignores our update prompt. If we only trigger it based on <code>updatefound</code> event, we have a single window of opportunity. The solution would be to additionally check for <code>registration.waiting</code> instance existence on every page load. If we detect something there, it must mean the user ignored our update UX in one of the previous page views and we should somehow act on it (either show the prompt once again or invoke the update immediately, in case it makes sense in our app).</p>\n<h2 id=\"in-code-we-trust\">In code we trust</h2>\n<p>Here is the full app-side code of the proposed solution, based on explicit user prompt to apply the update (note the UI notification element itself is not included):</p>\n<pre><code>function invokeServiceWorkerUpdateFlow(registration) {\n    // TODO implement your own UI notification element\n    notification.show(&quot;New version of the app is available. Refresh now?&quot;);\n    notification.addEventListener(&#39;click&#39;, () =&gt; {\n        if (registration.waiting) {\n            // let waiting Service Worker know it should became active\n            registration.waiting.postMessage(&#39;skip waiting&#39;)\n        }\n    })\n}\n\n// check if the browser supports serviceWorker at all\nif (&#39;serviceWorker&#39; in navigator) {\n    // wait for the page to load\n    window.addEventListener(&#39;load&#39;, async () =&gt; {\n        // register the service worker from the file specified\n        const registration = await navigator.serviceWorker.register(&#39;/service-worker.js&#39;)\n\n        // ensure the case when the updatefound event was missed is also handled\n        // by re-invoking the prompt when there&#39;s a waiting Service Worker\n        if (registration.waiting) {\n            invokeServiceWorkerUpdateFlow(registration)\n        }\n\n        // detect Service Worker update available and wait for it to become installed\n        registration.addEventListener(&#39;updatefound&#39;, () =&gt; {\n            if (registration.installing) {\n                // wait until the new Service worker is actually installed (ready to take over)\n                registration.installing.addEventListener(&#39;statechange&#39;, () =&gt; {\n                    if (registration.waiting) {\n                        // if there&#39;s an existing controller (previous Service Worker), show the prompt\n                        if (navigator.serviceWorker.controller) {\n                            invokeServiceWorkerUpdateFlow(registration)\n                        } else {\n                            // otherwise it&#39;s the first install, nothing to do\n                            console.log(&#39;Service Worker initialized for the first time&#39;)\n                        }\n                    }\n                })\n            }\n        })\n\n        let refreshing = false;\n\n        // detect controller change and refresh the page\n        navigator.serviceWorker.addEventListener(&#39;controllerchange&#39;, () =&gt; {\n            if (!refreshing) {\n                window.location.reload()\n                refreshing = true\n            }\n        })\n    })\n}</code></pre><p>And at the Service Worker side (ensure not to have <code>self.skipWaiting()</code> call in the <code>install</code> handler):</p>\n<pre><code>self.addEventListener(&#39;message&#39;, (event) =&gt; {\n    if (event.data === &#39;SKIP_WAITING&#39;) {\n        self.skipWaiting();\n    });\n});</code></pre><h2 id=\"chrome-dev-tools-support\">Chrome Dev Tools support</h2>\n<p>The whole process is quite complex and it might be extremely difficult to debug. Fortunately, Google Chrome&#39;s Dev Tools can support us here thanks to the features from Application &gt; Service Worker section. Firstly, it nicely visualizes the states of our Service Worker instances with colored marbles. It&#39;s clearly visible when the new instance is being installed or when it&#39;s waiting for its takeover moment.</p>\n<figure>\n  <img src=\"/articleimgs/sw-updates-4.png\" alt=\"Chrome Dev Tools - Application - Service Worker tab and its useful controls\" />\n  <figcaption>Chrome Dev Tools - Application - Service Worker tab and its useful controls</figcaption>\n</figure>\n\n<p>It also provides two useful buttons with self-descriptive labels: &quot;update&quot; forces a check for new Service Worker version, &quot;skipWaiting&quot; on the waiting instance activates it immediately. The real deal is with &quot;Update on reload&quot; switch, though. When turned on, it removes the need for the whole flow and activates the Service Worker immediately after it has been installed. This is very useful in everyday development when deferred updates and Service Worker-level caches will make the development experience pretty cumbersome. On the other hand, we need to make sure the switch is OFF when we&#39;re working on the actual flow, so that it doesn&#39;t interfere with the ordinary user flow.</p>\n<h2 id=\"\">**</h2>\n<p>Whichever strategy of handling Service Worker updates we apply, it has its own cons and probably means the traditional trait of the ever-green Web with no need to apply updates is more or less broken. That&#39;s the unfortunate side of how Service Workers lifecycle is implemented and there&#39;s no other way than to embrace it.</p>\n","image":"/articleimgs/floor-plan-on-table.pexels.jpg","tags":["Service Worker","Offline Capabilities"],"description":"Most of the Service Worker tutorials we can find on the Web focus on the initial development efforts needed to get the offline mode capabilities or performance gains for subsequent visits. But for production readiness, it is not enough, though. We need to have the update strategy in place not to cut off our users from actually getting the updates of our PWA.","author":"<p><a href=\"https://adambar.pl\">Adam Bar</a></p>\n","weight":2,"source":"wwcd"}