{"title":"Progressive Web Apps – standard or buzzword?","slug":"progressive-web-apps-standard-or-buzzword","html":"<p>Progressive Web Apps (PWA) is a modern way to build applications, including mobile ones, using purely web technologies and relying purely on the capabilities and strengths of the Web platform. Historically, it was the lack of these capabilities on the Web that caused the boom of the mobile apps, using so-called &quot;native&quot; (platform-specific) development approaches. </p>\n<p>The time has passed and the Web is now fighting back with the new, strong capabilities, in many cases not worse than what the native platforms can offer. And now, there&#39;s a growing trend of considering Progressive Web Apps as a viable strategy for the mobile presence for many brands.</p>\n<p>However, still, there also seems to exist a decent misunderstanding about what PWA term really constitutes, what does it mean for the application to become one and what changes in terms of the Web Platform&#39;s building blocks. The fact that PWA term was never officially defined by any authority does not help clearing out this unclearness. Let&#39;s try to sum up the facts on our own.</p>\n<h2 id=\"fact-1---pwa-is-only-a-buzzword\">Fact 1 - PWA is only a buzzword</h2>\n<p><img src=\"/articleimgs/adult-books-business-coffee.pexels.jpg\" alt=\"Progressive Web Apps – standard or buzzword?\"></p>\n<p>Progressive Web Apps as a term was <a href=\"https://infrequently.org/2015/06/progressive-apps-escaping-tabs-without-losing-our-soul/\">coined in 2015</a> by <a href=\"https://fberriman.com/about/\">Frances Berriman</a> and <a href=\"https://twitter.com/slightlylate\">Alex Russell</a> as the name for the new class of experiences utilizing the Web Platform in the new ways, allowing it to serve as the only technology required to achieve the native look-and-feel on mobile. It was rather a loose idea, and actually it stayed to be such. Even though most of the browser vendors use the PWA term in the developer-facing communication, no standard definition exists and no standard definition will probably exist in the future. </p>\n<p>Progressive Web Apps is mostly the marketing term to cover the idea that most of the applications do not have any real reason to be implemented and packaged as native apps. Nowadays, the capabilities of the Web platform include <a href=\"https://whatwebcando.today/installation.html\">home screen installability</a>, <a href=\"https://whatwebcando.today/offline.html\">offline capabilities</a> and the wide range of features and OS-level integrations that used to be available only for platform-specific development. Apart from this, with Web-first approach, the app owners might benefit from what the Web had always offered as its core functionalities - lack of troublesome and centralized distribution model via app stores and the ability to share it via the simplest and most well-known mechanism - links.</p>\n<h2 id=\"fact-2---pwa-does-not-revolutionize-the-web-development\">Fact 2 - PWA does not revolutionize the web development</h2>\n<p>Progressive Web Apps are still &quot;just&quot; the web applications. The term itself emphasise it well enough. Apps are things that the non tech-savvy people tap on their home screens and &quot;just use it&quot;. Thus, Web Apps are these that use the Web as the technology of choice - but there&#39;s nothing for the end user to care about. The key is in &quot;Progressive&quot; part - these apps take advantage of as much app-specific features as they need and as many as there are available on the current device. Some apps might only need <a href=\"https://whatwebcando.today/push-notifications.html\">push notifications</a>, others might only need <a href=\"https://whatwebcando.today/offline.html\">offline access</a>. And some might not necessarily need any of these but might benefit from them as an additional non-crucial features when they are available.</p>\n<p>Every existing application might be called a PWA if it takes advantage of the Web Platform capabilities in a way that makes it look and feel like native for the average mobile user. There&#39;s no need to migrate to the new technologies or to rewrite any fundamental parts of the average application to make it a good candidate to be called a &quot;real PWA&quot;. All the principles of the web still hold true regardless how much PWA-ness we introduce to our apps.</p>\n<h2 id=\"fact-3---there-are-only-three-must-have-traits-for-pwa\">Fact 3 - There are only three must-have traits for PWA</h2>\n<p>This kind of <a href=\"https://en.wikipedia.org/wiki/Progressive_enhancement\">progressive enhancement</a> approach, together with the lack of proper standard for PWA, raises a question what does it take for the &quot;normal&quot; web application to become a &quot;proper&quot; PWA. There can&#39;t be a single correct answer here, but there are three parts of the store that are crucial for the app to adhere to to consider it a PWA:</p>\n<ol>\n<li><strong><a href=\"https://w3c.github.io/ServiceWorker/\">Service Worker</a> existence</strong>. Service Worker is a piece of JavaScript code that runs outside the tabs and is an enabler for the broad range of app-like features like offline capabilities, background synchronization or push notifications. Without Service Worker handling the network unavailability case, the app is unable to provide any experience in such case and this is definitely not what the users are used to on mobile devices.</li>\n<li><strong>HTTPS certificate</strong>. Service Workers, as the extremely powerful feature, are specified to be only available for the websites that are loaded with proper security and privacy - namely HTTPS certificate. It becomes a requirement for the PWA, thus. The basic certificates are provided for free by many vendors, including <a href=\"https://hackernoon.com/getting-a-free-ssl-certificate-on-aws-a-how-to-guide-6ef29e576d22\">Amazon Web Services</a> and <a href=\"https://letsencrypt.org/\">Let&#39;s Encrypt</a>, so there should be no financial reason not to have it. Also, for the development convenience, HTTPS is not required when running our application from localhost environment.</li>\n<li><strong><a href=\"https://www.w3.org/TR/appmanifest/\">Web App Manifest</a></strong> file. To achieve the most visible native app trait for our web application, we need to provide some metadata, like the app&#39;s name and icon, through the standardized JSON file. It is then read by the client&#39;s browser and used to provide the UI allowing them to &quot;install&quot; the icon on the home screen. The manifest is also a way to let the system know how much of the browser&#39;s UI to show (via <code>display</code> property) and which part of our origin (address space) should be treated by the system as belonging to our PWA (via <code>scope</code> property).</li>\n</ol>\n<h2 id=\"fact-4---chrome-uses-lighthouse-to-run-more-checks\">Fact 4 - Chrome uses Lighthouse to run more checks</h2>\n<p>These three traits are the basis. It&#39;s a de-facto standard to go further and rely on what the biggest player in the market thinks about what it takes to develop a PWA - namely Google Chrome and their <a href=\"https://developers.google.com/web/tools/lighthouse\">Lighthouse</a> - an automated audit tool for the web. The tool checks for the existence of particular traits of the application to give it a PWA badge. There are <a href=\"https://developers.google.com/web/progressive-web-apps/checklist\">numerous checks</a> within &quot;Progressive Web App&quot; audit category, most of them are actually testable in an automated manner.</p>\n<p>Apart for the general offline availability and installability, Chrome puts focus on performance bits. The application that fails to provide a fast response doesn&#39;t get the Lighthouse&#39;s PWA badge. It is also important for the apps that we want to package as <a href=\"https://blog.chromium.org/2019/02/introducing-trusted-web-activity-for.html\">Trusted Web Activity</a> and publish in the Google Play Store - there is a hard requirement for the apps to receive at least 80 points in the Lighthouse&#39;s Performance section to be allowed in Google Play.</p>\n<h2 id=\"\">**</h2>\n<p>Progressive Web App term can probably be considered a short-term buzzword that is going to be obsolete when the practices and technologies that now constitute it became the de-facto standards and every website will take advantage of it, at least partially. This is what happened with terms like <a href=\"https://en.wikipedia.org/wiki/Ajax_(programming)\">AJAX</a> or <a href=\"https://en.wikipedia.org/wiki/Web_2.0\">Web 2.0</a> that became extinct after their offerings became the obvious part of the web development. Likewise, this is happening with <a href=\"https://en.wikipedia.org/wiki/Responsive_web_design\">responsive web design</a> term that with the mobile traffic growth mostly becomes synonymous with just &quot;web design&quot;. </p>\n<p>Progressive Web Apps are still rather new concept and until it becomes a norm for the applications to include the offline capabilities and to expect web applications to be installable on the home screen, we need the separate marketing term to promote these ideas. After this happens, it will be obvious to expect from the Web applications to behave as the mobile user expects and we&#39;ll be able to refer to PWAs just as &quot;web apps&quot;. Or even just &quot;apps&quot;, as for the end user it doesn&#39;t really matter what kind of technology is there under the hood, as long as the app does its job well, and this is definitely possible on the Web today.</p>\n","image":"/articleimgs/adult-books-business-coffee.pexels.jpg","tags":["PWA","Service Worker"],"description":"Progressive Web Apps (PWA) is a modern way to build applications, including mobile ones, using purely web technologies and relying purely on the capabilities and strengths of the Web platform. Historically, it was the lack of these capabilities on the Web that caused the boom of the mobile apps, using so-called \"native\" (platform-specific) development approaches.","author":"<p><a href=\"https://adambar.pl\">Adam Bar</a></p>\n","weight":2,"source":"wwcd"}