{"title":"Tracking home screen visits and installations","slug":"tracking-home-screen-visits-installations","html":"<p>Analytics is the key non-functional feature our applications need to have nowadays. It&#39;s the hard numbers that should have the decisive voice whenever it must be chosen whether a feature, design or idea is worth exploring. With new Web APIs and the rise of the Progressive Web Applications, there are new aspects we should keep track of and possibly use as an axis of our analysis.</p>\n<h2 id=\"visits-from-installed-app\">Visits from installed app</h2>\n<p><img src=\"/articleimgs/black-tablet-computer.pexels.jpg\" alt=\"Tracking home screen visits and installations\"></p>\n<p>Thanks to the <a href=\"https://whatwebcando.today/installation.html\">Home Screen Installability</a>, we have a new way our users might land in our app, besides traditional search results, external links, social shares or direct visits by entering the URL into the browser&#39;s address bar – via the OS-level home screen icon (or whatever is the mean given operating system lists the installed applications). </p>\n<p>Ignoring this new distinct source of traffic, we end up mixing it together with direct visits, as no referrer information is available for this kind of requests. Fortunately, <a href=\"https://www.w3.org/TR/appmanifest/#start_url-member\">Web App Manifest standard</a> gives us a handy way to draw the line between these sources with the <code>start_url</code> property. It is designed to specify at which page should we start our app when opened as the system-installed app, i.e. from the home screen icon. Its value should be set to an URL – either absolute or relative to the Manifest location, with latter making it easier to share between the environments. It needs to be contained within the <a href=\"https://www.w3.org/TR/appmanifest/#scope-member\">Web Manifest&#39;s scope</a>, but not necessarily be equal to the URL from which the user linked to the Manifest. </p>\n<pre><code>{\n    &quot;start_url&quot;: &quot;/&quot;\n}</code></pre><p>Usually we use it to direct those loyal users to the home page, or maybe some kind of specific landing page. But nothing stops us from adding the tracking-specific query parameters there, for example <code>/?source=homescreen</code>. This way the URL remembered by the operating system as a starting point of the installed application will include the <code>source</code> parameter that wouldn&#39;t normally be set by any other traffic source. It might be consumed by our application however we please, including sending it to our analytics tool. Specifically, for Google Analytics, we might include it directly as the <a href=\"https://en.wikipedia.org/wiki/UTM_parameters\"><code>utm_source</code> parameter</a> that will be consumed by Google Analytics out-of-the-box:</p>\n<pre><code>{\n    &quot;start_url&quot;: &quot;/?utm_source=homescreen&quot;\n}</code></pre><p>This way <code>homescreen</code> will automatically be listed as an acquisition source for the traffic incoming from the installed app and available in Google Analytics &quot;Source / Medium&quot; report:</p>\n<figure>\n  <img src=\"/articleimgs/tracking-hs-visits-installs.png\" alt=\"'Homescreen' listed as an acquisition source for the traffic incoming from the installed app and available in Google Analytics 'Source / Medium' report\" width=\"240\" />\n  <figcaption>\"Homescreen\" listed as an acquisition source for the traffic incoming from the installed app and available in Google Analytics \"Source / Medium\" report</figcaption>\n</figure>\n\n<h2 id=\"install-prompts-success-rate\">Install prompts success rate</h2>\n<p>Tracking the rate of installs would also be helpful to determine the success rate of the <a href=\"https://developers.google.com/web/fundamentals/app-install-banners#show_the_prompt\">&quot;add to home screen&quot; prompts</a>. This issue is harder, though, because browsers vary in what kind of UI they offer to trigger the installation. As of the end of 2019, all browsers but Chrome on Android only present a small icon in the address bar or the other part of the browser&#39;s UI that, when tapped, invokes the system-level installation prompt. Neither the button tap nor its outcome can be tracked at the app level, because these are the parts of the browser UI, not available for the app code.</p>\n<p>We might track the prompts in Chrome on Android, though, thanks to how this browser notifies the app when it&#39;s about to show the &quot;add to home screen&quot; prompt. Chrome fires <code>beforeinstallprompt</code> event to the <code>window</code> object and we might use it to replace the native prompt with our custom UI, where it&#39;s our code that decides how to present the UI and it&#39;s us who triggers the actual system-level prompt when the user intends to install the app. This code lets us to record the custom analytics events on every step of this process - prompt eligibility, actual prompt presentation and its outcome. This is presented in this pseudocode:</p>\n<pre><code>window.addEventListener(&#39;beforeinstallprompt&#39;, (event) =&gt; {\n    // the event was fired, so Chrome allows us to show the custom installation UI now; let&#39;s track this fact and show it\n    Analytics.trackEvent(&#39;eligible for prompt&#39;); \n    showCustomUI()\n\n    // when the user clicks the button within our custom UI, we track this event and present the actual system-level prompt\n    customButton.addEventListener(&#39;click&#39;, () =&gt; {\n        Analytics.trackEvent(&#39;prompt shown&#39;)\n        const result = event.prompt()\n\n        // additionally, we wait for the prompt&#39;s outcome (either &quot;accepted&quot; or &quot;dismissed&quot;) and also record it as Analytics event\n        event.userChoice\n            .then((choice) =&gt; Analytics.trackEvent(`prompt ${choice.outcome}`))\n    })\n})\n</code></pre><p>By replacing <code>Analytics.trackEvent</code> with the appropriate API call or SDK invocation for our Analytics service, we get the data fed into our reports. For Google Analytics, that would mean calling <a href=\"https://developers.google.com/analytics/devguides/collection/analyticsjs/sending-hits\"><code>ga(&#39;send&#39;, &#39;event&#39;, category, event, label, value)</code> method</a> and expecting these numbers to show up in the Events report.</p>\n","image":"/articleimgs/black-tablet-computer.pexels.jpg","tags":["PWA","Home Screen Installability"],"description":"Analytics is the key non-functional feature our applications need to have nowadays. It's the hard numbers that should have the decisive voice whenever it must be chosen whether a feature, design or idea is worth exploring. With new Web APIs and the rise of the Progressive Web Applications, there are new aspects we should keep track of and possibly use as an axis of our analysis.","author":"<p><a href=\"https://adambar.pl\">Adam Bar</a></p>\n","weight":1,"source":"wwcd"}